Repository: tashri-dev/Salawaty
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: ar, fr, id, tr, ur

source: PrayerBar needs your location to calculate prayer times.
ar: يحتاج PrayerBar إلى موقعك لحساب مواقيت الصلاة بدقة.
fr: PrayerBar a besoin de votre position pour calculer les heures de prière avec précision.
id: PrayerBar memerlukan lokasi Anda untuk menghitung waktu salat secara akurat.
tr: PrayerBar, doğru namaz vakitlerini hesaplamak için konumunuza ihtiyaç duyar.
ur: PrayerBar کو نماز کے درست اوقات معلوم کرنے کے لیے آپ کے مقام کی ضرورت ہے۔

source: Allow Location Access
ar: السماح بالوصول إلى الموقع
fr: Autoriser l’accès à la position
id: Izinkan Akses Lokasi
tr: Konum Erişimine İzin Ver
ur: مقام تک رسائی کی اجازت دیں

source: Enter a city instead
ar: أدخل مدينة بدلاً من ذلك
fr: Saisir une ville à la place
id: Masukkan kota sebagai gantinya
tr: Bunun yerine bir şehir girin
ur: اس کے بجائے شہر درج کریں

source: Finding your location…
ar: جارٍ تحديد موقعك…
fr: Recherche de votre position…
id: Mencari lokasi Anda…
tr: Konumunuz belirleniyor…
ur: آپ کا مقام معلوم کیا جا رہا ہے…

source: Set City…
ar: تحديد المدينة…
fr: Définir la ville…
id: Atur Kota…
tr: Şehir Belirle…
ur: شہر مقرر کریں…

source: Refresh Location
ar: تحديث الموقع
fr: Actualiser la position
id: Segarkan Lokasi
tr: Konumu Yenile
ur: مقام تازہ کریں

source: Quit
ar: إنهاء
fr: Quitter
id: Keluar
tr: Çıkış
ur: بند کریں

source: Next prayer
ar: الصلاة القادمة
fr: Prochaine prière
id: Salat berikutnya
tr: Sıradaki namaz
ur: اگلی نماز

source: Stop
ar: إيقاف
fr: Arrêter
id: Berhenti
tr: Durdur
ur: روکیں

source: Starts tomorrow
ar: يبدأ غدًا
fr: Commence demain
id: Dimulai besok
tr: Yarın başlıyor
ur: کل سے شروع

source: Not now
ar: ليس الآن
fr: Pas maintenant
id: Nanti saja
tr: Şimdi değil
ur: ابھی نہیں

source: Allow
ar: سماح
fr: Autoriser
id: Izinkan
tr: İzin Ver
ur: اجازت دیں

source: Back
ar: رجوع
fr: Retour
id: Kembali
tr: Geri
ur: واپس

source: Settings
ar: الإعدادات
fr: Réglages
id: Pengaturan
tr: Ayarlar
ur: ترتیبات

source: Calculation
ar: طريقة الحساب
fr: Calcul
id: Perhitungan
tr: Hesaplama
ur: حساب

source: Method
ar: الطريقة
fr: Méthode
id: Metode
tr: Yöntem
ur: طریقہ

source: High latitudes
ar: خطوط العرض العالية
fr: Hautes latitudes
id: Lintang tinggi
tr: Yüksek enlemler
ur: بلند عرض بلد

source: Notifications
ar: الإشعارات
id: Notifikasi
tr: Bildirimler
ur: اطلاعات

source: Alert at prayer times
ar: تنبيه عند وقت الصلاة
fr: Alerter aux heures de prière
id: Beri tahu saat waktu salat
tr: Namaz vakitlerinde uyar
ur: نماز کے وقت مطلع کریں

source: Early reminder
ar: تذكير مبكر
fr: Rappel anticipé
id: Pengingat awal
tr: Erken hatırlatma
ur: پہلے سے یاد دہانی

source: Off
ar: إيقاف
fr: Désactivé
id: Nonaktif
tr: Kapalı
ur: بند

source: Morning & evening adhkar reminder
ar: تذكير بأذكار الصباح والمساء
fr: Rappel des invocations du matin et du soir
id: Pengingat zikir pagi & petang
tr: Sabah ve akşam zikir hatırlatması
ur: صبح و شام کے اذکار کی یاد دہانی

source: Adhkar, duas & Quran
ar: الأذكار والأدعية والقرآن
fr: Adhkar, invocations et Coran
id: Zikir, doa & Al-Qur'an
tr: Zikirler, dualar ve Kur'an
ur: اذکار، دعائیں اور قرآن

source: Show a new one every
ar: إظهار عنصر جديد كل
fr: Afficher un nouveau toutes les
id: Tampilkan yang baru setiap
tr: Yeni bir tane göster:
ur: نیا آئٹم دکھائیں ہر

source: 15 minutes
ar: ١٥ دقيقة
id: 15 menit
tr: 15 dakika
ur: 15 منٹ

source: 30 minutes
ar: ٣٠ دقيقة
id: 30 menit
tr: 30 dakika
ur: 30 منٹ

source: 1 hour
ar: ساعة واحدة
fr: 1 heure
id: 1 jam
tr: 1 saat
ur: 1 گھنٹہ

source: 2 hours
ar: ساعتان
fr: 2 heures
id: 2 jam
tr: 2 saat
ur: 2 گھنٹے

source: 3 hours
ar: ٣ ساعات
fr: 3 heures
id: 3 jam
tr: 3 saat
ur: 3 گھنٹے

source: 6 hours
ar: ٦ ساعات
fr: 6 heures
id: 6 jam
tr: 6 saat
ur: 6 گھنٹے

source: Send as a notification
ar: الإرسال كإشعار
fr: Envoyer sous forme de notification
id: Kirim sebagai notifikasi
tr: Bildirim olarak gönder
ur: بطور اطلاع بھیجیں

source: Show English meaning
ar: إظهار المعنى بالإنجليزية
fr: Afficher le sens en anglais
id: Tampilkan arti bahasa Inggris
tr: İngilizce anlamını göster
ur: انگریزی مفہوم دکھائیں

source: Menu bar
ar: شريط القوائم
fr: Barre de menus
id: Bilah menu
tr: Menü çubuğu
ur: مینیو بار

source: Show countdown (instead of time)
ar: إظهار العد التنازلي (بدلاً من الوقت)
fr: Afficher le compte à rebours (au lieu de l’heure)
id: Tampilkan hitung mundur (bukan waktu)
tr: Geri sayımı göster (saat yerine)
ur: کاؤنٹ ڈاؤن دکھائیں (وقت کی بجائے)

source: Arabic prayer names
ar: أسماء الصلوات بالعربية
fr: Noms des prières en arabe
id: Nama salat dalam bahasa Arab
tr: Namaz adlarını Arapça göster
ur: نمازوں کے نام عربی میں

source: Show prayer name with iqamah countdown
ar: إظهار اسم الصلاة مع العد التنازلي للإقامة
fr: Afficher le nom de la prière avec le compte à rebours de l’iqama
id: Tampilkan nama salat dengan hitung mundur iqamah
tr: İkamet geri sayımıyla namaz adını göster
ur: اقامت کاؤنٹ ڈاؤن کے ساتھ نماز کا نام دکھائیں

source: Launch at login
ar: التشغيل عند بدء الدخول
fr: Lancer à la connexion
id: Jalankan saat masuk
tr: Girişte başlat
ur: لاگ ان پر شروع کریں

source: No adhan recordings yet. Tap “Add Sound…” to import MP3/M4A files of your favourite sheikhs.
ar: لا توجد تسجيلات أذان بعد. اضغط “إضافة صوت…” لاستيراد ملفات MP3/M4A لمشايخك المفضلين.
fr: Aucun enregistrement d’adhan pour l’instant. Appuyez sur « Ajouter un son… » pour importer des fichiers MP3/M4A de vos cheikhs préférés.
id: Belum ada rekaman azan. Ketuk “Tambah Suara…” untuk mengimpor file MP3/M4A dari syekh favorit Anda.
tr: Henüz ezan kaydı yok. Sevdiğiniz hafızların MP3/M4A dosyalarını içe aktarmak için “Ses Ekle…” ye dokunun.
ur: ابھی تک اذان کی کوئی ریکارڈنگ نہیں۔ اپنے پسندیدہ قاریوں کی MP3/M4A فائلیں درآمد کرنے کے لیے “صوت شامل کریں…” دبائیں۔

source: Reciter
ar: القارئ
fr: Récitateur
id: Qari
tr: Okuyan
ur: قاری

source: Automatic
ar: تلقائي
fr: Automatique
id: Otomatis
tr: Otomatik
ur: خودکار

source: Fajr adhan
ar: أذان الفجر
fr: Adhan du Fajr
id: Azan Subuh
tr: Sabah ezanı
ur: فجر کی اذان

source: Same reciter (Fajr version if available)
ar: نفس القارئ (نسخة الفجر إن توفرت)
fr: Même récitateur (version Fajr si disponible)
id: Qari yang sama (versi Subuh jika tersedia)
tr: Aynı okuyucu (varsa Sabah versiyonu)
ur: وہی قاری (اگر دستیاب ہو تو فجر ورژن)

source: Play adhan for
ar: تشغيل الأذان لـ
fr: Jouer l’adhan pour
id: Putar azan untuk
tr: Ezanı şunlar için çal
ur: اذان چلائیں برائے

source: Add Sound…
ar: إضافة صوت…
fr: Ajouter un son…
id: Tambah Suara…
tr: Ses Ekle…
ur: صوت شامل کریں…

source: Seasonal audio
ar: الصوتيات الموسمية
fr: Sons saisonniers
id: Audio musiman
tr: Mevsimsel sesler
ur: موسمی آڈیو

source: Recording
ar: التسجيل
fr: Enregistrement
id: Rekaman
tr: Kayıt
ur: ریکارڈنگ

source: Repeat every
ar: التكرار كل
fr: Répéter toutes les
id: Ulangi setiap
tr: Şu sıklıkla tekrarla
ur: دہرائیں ہر

source: Plays occasionally in the background on Eid and during Hajj days — never continuously.
ar: يُشغَّل أحيانًا في الخلفية في العيد وأثناء أيام الحج — وليس باستمرار أبدًا.
fr: Se joue occasionnellement en arrière-plan pendant l’Aïd et les jours du Hajj — jamais en continu.
id: Diputar sesekali di latar belakang saat Idulfitri/Iduladha dan selama hari-hari Haji — tidak pernah terus-menerus.
tr: Bayramda ve Hac günlerinde arka planda ara sıra çalar — asla sürekli değil.
ur: عید کے موقع پر اور حج کے ایام میں کبھی کبھار پس منظر میں چلتا ہے — کبھی مسلسل نہیں۔

source: Source
ar: المصدر
id: Sumber
tr: Kaynak
ur: ماخذ

source: Today
ar: اليوم
fr: Aujourd’hui
id: Hari ini
tr: Bugün
ur: آج

source: Update Now
ar: تحديث الآن
fr: Mettre à jour
id: Perbarui Sekarang
tr: Şimdi Güncelle
ur: ابھی اپ ڈیٹ کریں

source: If your country announced the start of the month a day earlier or later after the moon sighting, adjust by that many days here.
ar: إذا أعلن بلدك بداية الشهر قبل يوم أو بعده بعد رؤية الهلال، فاضبط بعدد الأيام هنا.
fr: Si votre pays a annoncé le début du mois un jour plus tôt ou plus tard après l’observation de la lune, ajustez ici de ce nombre de jours.
id: Jika negara Anda mengumumkan awal bulan sehari lebih awal atau lebih lambat setelah rukyat, sesuaikan jumlah harinya di sini.
tr: Ülkeniz hilal görüldükten sonra ayın başlangıcını bir gün erken veya geç açıkladıysa, burada o kadar gün ayarlayın.
ur: اگر آپ کے ملک نے چاند دیکھنے کے بعد مہینے کا آغاز ایک دن پہلے یا بعد میں اعلان کیا ہو تو یہاں اتنے دن ایڈجسٹ کریں۔

source: Notify at iqamah time
ar: التنبيه عند وقت الإقامة
fr: Notifier à l’heure de l’iqama
id: Beri tahu saat waktu iqamah
tr: İkamet vaktinde bildir
ur: اقامت کے وقت مطلع کریں

source: After adhan
ar: بعد الأذان
fr: Après l’adhan
id: Setelah azan
tr: Ezandan sonra
ur: اذان کے بعد

source: Set 0 min to turn the iqamah timer off for a prayer.
ar: اضبط ٠ دقيقة لإيقاف مؤقت الإقامة لصلاة معينة.
fr: Réglez 0 min pour désactiver le minuteur d’iqama pour une prière.
id: Atur 0 menit untuk mematikan pengatur waktu iqamah pada salat tertentu.
tr: Bir namaz için ikamet zamanlayıcısını kapatmak üzere 0 dakika ayarlayın.
ur: کسی نماز کے لیے اقامت ٹائمر بند کرنے کے لیے 0 منٹ مقرر کریں۔

source: Location
ar: الموقع
fr: Position
id: Lokasi
tr: Konum
ur: مقام

source: Use this Mac's location
ar: استخدام موقع هذا الماك
fr: Utiliser la position de ce Mac
id: Gunakan lokasi Mac ini
tr: Bu Mac'in konumunu kullan
ur: اس میک کا مقام استعمال کریں

source: Location access is denied — the city below is used instead.
ar: تم رفض الوصول إلى الموقع — يُستخدم بدلاً منه المدينة أدناه.
fr: L’accès à la position est refusé — la ville ci-dessous est utilisée à la place.
id: Akses lokasi ditolak — kota di bawah ini digunakan sebagai gantinya.
tr: Konum erişimi reddedildi — bunun yerine aşağıdaki şehir kullanılıyor.
ur: مقام تک رسائی مسترد کر دی گئی — اس کے بجائے نیچے دیا گیا شہر استعمال ہو رہا ہے۔

source: Open Privacy Settings
ar: فتح إعدادات الخصوصية
fr: Ouvrir les réglages de confidentialité
id: Buka Pengaturan Privasi
tr: Gizlilik Ayarlarını Aç
ur: پرائیویسی ترتیبات کھولیں

source: Following your location automatically
ar: متابعة موقعك تلقائيًا
fr: Suit automatiquement votre position
id: Mengikuti lokasi Anda secara otomatis
tr: Konumunuz otomatik olarak takip ediliyor
ur: آپ کے مقام کی خودکار پیروی ہو رہی ہے

source: Set
ar: تعيين
fr: Définir
id: Atur
tr: Ayarla
ur: مقرر کریں

source: Fixed time
ar: وقت ثابت
fr: Heure fixe
id: Waktu tetap
tr: Sabit saat
ur: مقررہ وقت

source: Copy
ar: نسخ
fr: Copier
id: Salin
tr: Kopyala
ur: کاپی کریں

source: Show another
ar: إظهار آخر
fr: Afficher un autre
id: Tampilkan lainnya
tr: Başka göster
ur: دوسرا دکھائیں

source: Open the sounds folder
ar: فتح مجلد الأصوات
fr: Ouvrir le dossier des sons
id: Buka folder suara
tr: Sesler klasörünü aç
ur: صوتی فولڈر کھولیں

source: City, e.g. Cairo, Egypt
ar: المدينة، مثال: القاهرة، مصر
fr: Ville, ex. Le Caire, Égypte
id: Kota, mis. Kairo, Mesir
tr: Şehir, örn. Kahire, Mısır
ur: شہر، مثلاً قاہرہ، مصر

source: Couldn't find that place. Try “City, Country”.
ar: تعذر العثور على هذا المكان. جرّب “المدينة، الدولة”.
fr: Impossible de trouver ce lieu. Essayez « Ville, Pays ».
id: Tempat tidak ditemukan. Coba “Kota, Negara”.
tr: Bu yer bulunamadı. “Şehir, Ülke” biçiminde deneyin.
ur: یہ مقام نہیں ملا۔ “شہر، ملک” آزمائیں۔

source: Starts in %lld days
ar: يبدأ بعد %lld يومًا
fr: Commence dans %lld jours
id: Dimulai dalam %lld hari
tr: %lld gün sonra başlıyor
ur: %lld دن بعد شروع

source: %lld min before
ar: قبل %lld دقيقة
fr: %lld min avant
id: %lld menit sebelum
tr: %lld dakika önce
ur: %lld منٹ پہلے

source: Location set to %@
ar: تم تعيين الموقع إلى %@
fr: Position définie sur %@
id: Lokasi diatur ke %@
tr: Konum %@ olarak ayarlandı
ur: مقام %@ مقرر کر دیا گیا

source: Saved city: %@
ar: المدينة المحفوظة: %@
fr: Ville enregistrée : %@
id: Kota tersimpan: %@
tr: Kayıtlı şehir: %@
ur: محفوظ شدہ شہر: %@

source: Iqamah %@
ar: الإقامة %@
fr: Iqama %@
tr: İkamet %@
ur: اقامت %@

source: Glory be to Allah and praise Him; glory be to Allah the Magnificent.
fr: Gloire à Allah et louange à Lui ; gloire à Allah le Magnifique.
id: Mahasuci Allah dan segala puji bagi-Nya; Mahasuci Allah Yang Mahaagung.
tr: Allah'ı hamd ile tesbih ederim; yüce Allah'ı tesbih ederim.
ur: اللہ پاک ہے اور اسی کی تعریف ہے، اللہ پاک ہے جو عظمت والا ہے۔

source: None has the right to be worshipped but Allah alone, without partner. His is the dominion and the praise, and He has power over all things.
fr: Nul n'a le droit d'être adoré si ce n'est Allah, l'Unique, sans associé. À Lui appartiennent la royauté et la louange, et Il est Capable de toute chose.
id: Tiada tuhan yang berhak disembah selain Allah semata, tiada sekutu bagi-Nya. Milik-Nya kerajaan dan pujian, dan Dia Mahakuasa atas segala sesuatu.
tr: Allah'tan başka hiçbir ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'nadır ve O her şeye kadirdir.
ur: اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ بادشاہی اسی کی ہے اور تعریف اسی کی ہے اور وہ ہر چیز پر قادر ہے۔

source: Glory be to Allah, praise be to Allah, none is worthy of worship but Allah, and Allah is the Greatest.
fr: Gloire à Allah, louange à Allah, nul n'est digne d'adoration sauf Allah, et Allah est le Plus Grand.
id: Mahasuci Allah, segala puji bagi Allah, tiada tuhan selain Allah, dan Allah Mahabesar.
tr: Allah'ı tesbih ederim, Allah'a hamd ederim, Allah'tan başka ilah yoktur, Allah en büyüktür.
ur: اللہ پاک ہے، اللہ کی تعریف ہے، اللہ کے سوا کوئی معبود نہیں، اور اللہ سب سے بڑا ہے۔

source: There is no might nor power except with Allah.
fr: Il n'y a de force ni de puissance qu'en Allah.
id: Tiada daya dan upaya kecuali dengan pertolongan Allah.
tr: Güç ve kuvvet ancak Allah iledir.
ur: کوئی طاقت اور قوت نہیں مگر اللہ کی مدد سے۔

source: I seek Allah's forgiveness and turn to Him in repentance.
fr: Je demande pardon à Allah et me repens à Lui.
id: Aku memohon ampun kepada Allah dan bertobat kepada-Nya.
tr: Allah'tan bağışlanma diler ve O'na tövbe ederim.
ur: میں اللہ سے بخشش مانگتا ہوں اور اسی کی طرف توبہ کرتا ہوں۔

source: O Allah, send blessings and peace upon our Prophet Muhammad.
fr: Ô Allah, accorde Tes bénédictions et Ta paix à notre Prophète Muhammad.
id: Ya Allah, limpahkanlah selawat dan salam kepada Nabi kami Muhammad.
tr: Allah'ım! Peygamberimiz Muhammed'e salât ve selam eyle.
ur: اے اللہ! ہمارے نبی محمد پر درود و سلام بھیج۔

source: In the name of Allah, with whose name nothing on earth or in heaven can cause harm, and He is the All-Hearing, All-Knowing. (3× morning & evening)
fr: Au nom d'Allah, avec le nom duquel rien sur terre ni dans le ciel ne peut nuire, et Il est Celui qui entend tout, qui sait tout. (3× matin et soir)
id: Dengan nama Allah, yang dengan nama-Nya tidak ada sesuatu pun di bumi dan di langit yang dapat membahayakan, dan Dia Maha Mendengar, Maha Mengetahui. (3× pagi & petang)
tr: O'nun adıyla yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah'ın adıyla; O, işitendir, bilendir. (Sabah akşam 3 kez)
ur: اللہ کے نام سے جس کے نام کے ساتھ زمین و آسمان میں کوئی چیز نقصان نہیں دے سکتی، اور وہ سننے والا جاننے والا ہے۔ (صبح و شام 3 بار)

source: Allah is sufficient for me; there is no god but Him. In Him I trust, and He is Lord of the Mighty Throne. (7× morning & evening)
fr: Allah me suffit ; il n'y a de divinité que Lui. En Lui je place ma confiance, et Il est le Seigneur du Trône Immense. (7× matin et soir)
id: Cukuplah Allah bagiku, tiada tuhan selain Dia. Kepada-Nya aku bertawakal, dan Dia adalah Tuhan pemilik 'Arsy yang agung. (7× pagi & petang)
tr: Allah bana yeter, O'ndan başka ilah yoktur. O'na tevekkül ettim, O yüce Arş'ın Rabbidir. (Sabah akşam 7 kez)
ur: اللہ میرے لیے کافی ہے، اس کے سوا کوئی معبود نہیں۔ میں نے اسی پر بھروسہ کیا اور وہ عرش عظیم کا رب ہے۔ (صبح و شام 7 بار)

source: I am pleased with Allah as my Lord, Islam as my religion, and Muhammad ﷺ as my Prophet.
fr: Je suis satisfait d'Allah comme Seigneur, de l'Islam comme religion, et de Muhammad ﷺ comme Prophète.
id: Aku ridha Allah sebagai Tuhanku, Islam sebagai agamaku, dan Muhammad ﷺ sebagai Nabiku.
tr: Rab olarak Allah'tan, din olarak İslam'dan, peygamber olarak Muhammed'den (sav) razıyım.
ur: میں اللہ کے رب ہونے، اسلام کے دین ہونے اور محمد ﷺ کے نبی ہونے پر راضی ہوں۔

source: Sayyid al-Istighfar — the master supplication for forgiveness.
fr: Sayyid al-Istighfar — la meilleure invocation de demande de pardon.
id: Sayyidul Istighfar — doa permohonan ampun yang paling utama.
tr: Seyyidü'l-İstiğfar — bağışlanma dualarının en üstünü.
ur: سیّد الاستغفار — بخشش کی دعاؤں میں سب سے بہترین دعا۔

source: Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.
fr: Notre Seigneur, accorde-nous une belle part ici-bas et une belle part dans l'au-delà, et préserve-nous du châtiment du Feu.
id: Ya Tuhan kami, berikanlah kepada kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami dari azab neraka.
tr: Rabbimiz! Bize dünyada iyilik, ahirette de iyilik ver ve bizi ateş azabından koru.
ur: اے ہمارے رب! ہمیں دنیا میں بھلائی دے اور آخرت میں بھی بھلائی دے اور ہمیں دوزخ کے عذاب سے بچا۔

source: O Allah, I ask You for pardon and well-being in this world and the Hereafter.
fr: Ô Allah, je Te demande le pardon et le bien-être ici-bas et dans l'au-delà.
id: Ya Allah, aku memohon kepada-Mu ampunan dan keselamatan di dunia dan akhirat.
tr: Allah'ım! Senden dünyada ve ahirette af ve afiyet dilerim.
ur: اے اللہ! میں تجھ سے دنیا و آخرت میں معافی اور عافیت مانگتا ہوں۔

source: O Turner of hearts, keep my heart firm upon Your religion.
fr: Ô Toi qui retournes les cœurs, affermis mon cœur dans Ta religion.
id: Wahai Yang membolak-balikkan hati, teguhkanlah hatiku di atas agama-Mu.
tr: Ey kalpleri evirip çeviren Allah'ım, kalbimi dinin üzere sabit kıl.
ur: اے دلوں کو پھیرنے والے! میرے دل کو اپنے دین پر ثابت رکھ۔

source: O Allah, help me to remember You, thank You, and worship You well.
fr: Ô Allah, aide-moi à me souvenir de Toi, à Te remercier et à T'adorer excellemment.
id: Ya Allah, bantulah aku untuk mengingat-Mu, bersyukur kepada-Mu, dan beribadah dengan baik kepada-Mu.
tr: Allah'ım! Seni anmak, sana şükretmek ve sana güzelce ibadet etmek konusunda bana yardım et.
ur: اے اللہ! مجھے اپنے ذکر، شکر اور اچھی عبادت پر میری مدد فرما۔

source: My Lord, expand my chest for me and ease my task for me.
fr: Mon Seigneur, ouvre pour moi ma poitrine et facilite ma mission.
id: Ya Tuhanku, lapangkanlah dadaku dan mudahkanlah urusanku.
tr: Rabbim! Göğsümü genişlet, işimi kolaylaştır.
ur: اے میرے رب! میرا سینہ کھول دے اور میرا کام میرے لیے آسان کر دے۔

source: O Allah, I seek refuge in You from worry and grief, and from helplessness and laziness.
fr: Ô Allah, je cherche refuge auprès de Toi contre le souci et la tristesse, l'incapacité et la paresse.
id: Ya Allah, aku berlindung kepada-Mu dari rasa cemas dan sedih, serta dari lemah dan malas.
tr: Allah'ım! Kederden ve üzüntüden, acizlikten ve tembellikten sana sığınırım.
ur: اے اللہ! میں فکر اور غم سے، اور بے بسی اور سستی سے تیری پناہ چاہتا ہوں۔

source: My Lord, make me one who establishes prayer, and from my descendants. Our Lord, accept my supplication.
fr: Mon Seigneur, fais de moi celui qui accomplit assidûment la prière, ainsi que de ma descendance. Notre Seigneur, exauce mon invocation.
id: Ya Tuhanku, jadikanlah aku orang yang tetap mendirikan salat, begitu pula sebagian keturunanku. Ya Tuhan kami, perkenankanlah doaku.
tr: Rabbim! Beni namazı dosdoğru kılan biri eyle, soyumdan da öyle kimseler kıl. Rabbimiz! Duamı kabul buyur.
ur: اے میرے رب! مجھے نماز قائم کرنے والا بنا اور میری اولاد میں سے بھی۔ اے ہمارے رب! میری دعا قبول فرما۔

source: Our Lord, do not let our hearts deviate after You have guided us, and grant us mercy from Yourself. You are the Bestower.
fr: Notre Seigneur, ne laisse pas dévier nos cœurs après nous avoir guidés, et accorde-nous une miséricorde venant de Toi. Tu es le Grand Donateur.
id: Ya Tuhan kami, janganlah Engkau condongkan hati kami setelah Engkau beri petunjuk, dan karuniakanlah kepada kami rahmat dari sisi-Mu. Sungguh, Engkaulah Maha Pemberi.
tr: Rabbimiz! Bizi doğru yola ilettikten sonra kalplerimizi eğriltme, katından bize rahmet bahşet. Şüphesiz sen çok bağışlayansın.
ur: اے ہمارے رب! ہمیں ہدایت دینے کے بعد ہمارے دلوں کو ٹیڑھا نہ کر اور اپنے پاس سے ہم پر رحمت نازل فرما، بے شک تو ہی بہت عطا کرنے والا ہے۔

source: My Lord, increase me in knowledge.
fr: Mon Seigneur, accrois mes connaissances.
id: Ya Tuhanku, tambahkanlah ilmu kepadaku.
tr: Rabbim! İlmimi artır.
ur: اے میرے رب! میرے علم میں اضافہ فرما۔

source: Surely, in the remembrance of Allah do hearts find rest.
fr: En vérité, c'est par le rappel d'Allah que les cœurs se tranquillisent.
id: Ingatlah, hanya dengan mengingat Allah hati menjadi tenteram.
tr: İyi bilin ki, kalpler ancak Allah'ı anmakla huzur bulur.
ur: خبردار! اللہ کے ذکر ہی سے دلوں کو اطمینان حاصل ہوتا ہے۔

source: So remember Me; I will remember you. Be grateful to Me and do not deny Me.
fr: Souvenez-vous donc de Moi, Je Me souviendrai de vous. Soyez-Moi reconnaissants et ne Me reniez pas.
id: Maka ingatlah kepada-Ku, niscaya Aku ingat kepadamu. Bersyukurlah kepada-Ku, dan janganlah kamu mengingkari-Ku.
tr: Öyleyse beni anın ki ben de sizi anayım; bana şükredin, nankörlük etmeyin.
ur: پس تم میرا ذکر کرو، میں تمہیں یاد رکھوں گا، اور میرا شکر ادا کرو اور میری ناشکری نہ کرو۔

source: For indeed, with hardship comes ease. Indeed, with hardship comes ease.
fr: Certes, avec la difficulté vient une facilité. Certes, avec la difficulté vient une facilité.
id: Maka sesungguhnya bersama kesulitan ada kemudahan. Sesungguhnya bersama kesulitan ada kemudahan.
tr: Şüphesiz her güçlükle beraber bir kolaylık vardır. Gerçekten her güçlükle beraber bir kolaylık vardır.
ur: بے شک مشکل کے ساتھ آسانی ہے۔ بے شک مشکل کے ساتھ آسانی ہے۔

source: Whoever relies upon Allah, He is sufficient for him.
fr: Quiconque place sa confiance en Allah, Il lui suffit.
id: Barang siapa bertawakal kepada Allah, niscaya Allah akan mencukupkan (keperluan)nya.
tr: Kim Allah'a güvenip dayanırsa, O ona yeter.
ur: جو شخص اللہ پر بھروسہ کرے تو وہ اس کے لیے کافی ہے۔

source: Allah does not burden a soul beyond what it can bear.
fr: Allah n'impose à aucune âme une charge supérieure à sa capacité.
id: Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya.
tr: Allah hiçbir kimseyi gücünün yetmeyeceği şeyle yükümlü tutmaz.
ur: اللہ کسی جان پر اس کی طاقت سے زیادہ بوجھ نہیں ڈالتا۔

source: When My servants ask you about Me — I am near. I answer the call of the caller when he calls upon Me.
fr: Et quand Mes serviteurs t'interrogent sur Moi, Je suis proche : Je réponds à l'appel de celui qui M'invoque quand il M'invoque.
id: Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka sesungguhnya Aku dekat. Aku kabulkan permohonan orang yang berdoa apabila ia berdoa kepada-Ku.
tr: Kullarım sana beni sorduğunda, şüphesiz ben yakınımdır; bana dua edenin duasına icabet ederim.
ur: اور جب میرے بندے تجھ سے میرے بارے میں پوچھیں تو میں قریب ہوں، پکارنے والے کی پکار کو قبول کرتا ہوں جب وہ مجھے پکارے۔

source: Indeed, prayer has been decreed upon the believers at fixed times.
fr: En vérité, la prière demeure, pour les croyants, une prescription à des temps déterminés.
id: Sesungguhnya salat itu adalah kewajiban yang ditentukan waktunya atas orang-orang yang beriman.
tr: Şüphesiz namaz, müminler üzerine vakitleri belirlenmiş bir farz olarak yazılmıştır.
ur: بے شک نماز مومنوں پر مقررہ اوقات میں فرض کی گئی ہے۔

source: And seek help through patience and prayer.
fr: Et cherchez secours dans l'endurance et la prière.
id: Dan mohonlah pertolongan (kepada Allah) dengan sabar dan salat.
tr: Sabır ve namazla yardım isteyin.
ur: اور صبر اور نماز سے مدد حاصل کرو۔
